# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [17]:
# import required libraries
import numpy as np
import pandas as pd
import random

Next, extract and import `Orders` dataset into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [37]:
# your code here

orders = pd.read_csv('/Users/GiadaSartori/Documents/IRONHACK/Lab/Week2/lab-dataframe-calculations/your-code/Orders.csv')
display(orders)

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
397920,541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
397921,541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397922,541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397923,541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

In [38]:
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

In [39]:
# your code here

orders['CustomerID'].nunique()

4339

In [40]:
orders['CustomerID'].unique()

array([17850, 13047, 12583, ..., 13298, 14569, 12713])

In [75]:
orders['CustomerID'].value_counts()

17841    7847
14911    5677
14096    5111
12748    4596
14606    2700
         ...
15313       1
17846       1
13185       1
16953       1
16737       1
Name: CustomerID, Length: 4339, dtype: int64

In [72]:
orders['Country'].unique()

array(['United Kingdom', 'France', 'Australia', 'Netherlands', 'Germany',
       'Norway', 'EIRE', 'Switzerland', 'Spain', 'Poland', 'Portugal',
       'Italy', 'Belgium', 'Lithuania', 'Japan', 'Iceland',
       'Channel Islands', 'Denmark', 'Cyprus', 'Sweden', 'Finland',
       'Austria', 'Greece', 'Singapore', 'Lebanon',
       'United Arab Emirates', 'Israel', 'Saudi Arabia', 'Czech Republic',
       'Canada', 'Unspecified', 'Brazil', 'USA', 'European Community',
       'Bahrain', 'Malta', 'RSA'], dtype=object)

In [74]:
orders['Country'].value_counts()

United Kingdom          354345
Germany                   9042
France                    8342
EIRE                      7238
Spain                     2485
Netherlands               2363
Belgium                   2031
Switzerland               1842
Portugal                  1462
Australia                 1185
Norway                    1072
Italy                      758
Channel Islands            748
Finland                    685
Cyprus                     614
Sweden                     451
Austria                    398
Denmark                    380
Poland                     330
Japan                      321
Israel                     248
Unspecified                244
Singapore                  222
Iceland                    182
USA                        179
Canada                     151
Greece                     145
Malta                      112
United Arab Emirates        68
European Community          60
RSA                         58
Lebanon                     45
Lithuania                   35
Brazil                      32
Czech Republic              25
Bahrain                     17
Saudi Arabia                 9
Name: Country, dtype: int64

In [89]:
group = orders.groupby('CustomerID')

agg_amount_spent = group.aggregate({'amount_spent': np.sum, 'Country' : np.min})

agg_amount_spent

            amount_spent         Country
CustomerID
12346           77183.60  United Kingdom
12347            4310.00         Iceland
12348            1797.24         Finland
12349            1757.55           Italy
12350             334.40          Norway
...                  ...             ...
18280             180.60  United Kingdom
18281              80.82  United Kingdom
18282             178.05  United Kingdom
18283            2094.88  United Kingdom
18287            1837.28  United Kingdom

[4339 rows x 2 columns]

In [81]:
print(type(agg_amount_spent))

<class 'pandas.core.frame.DataFrame'>

In [82]:
ranked_agg_amount_spent = agg_amount_spent.sort_values(by = 'amount_spent')
ranked_agg_amount_spent

            amount_spent         Country
CustomerID
13256               0.00  United Kingdom
16738               3.75  United Kingdom
14792               6.20  United Kingdom
16454               6.90  United Kingdom
17956              12.75  United Kingdom
...                  ...             ...
14911          143825.06            EIRE
16446          168472.50  United Kingdom
17450          194550.79  United Kingdom
18102          259657.30  United Kingdom
14646          280206.02     Netherlands

[4339 rows x 2 columns]

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

In [83]:
bins = pd.cut(ranked_agg_amount_spent['amount_spent'], 5)
bins

CustomerID
13256       (-280.206, 56041.204]
16738       (-280.206, 56041.204]
14792       (-280.206, 56041.204]
16454       (-280.206, 56041.204]
17956       (-280.206, 56041.204]
                   ...
14911    (112082.408, 168123.612]
16446    (168123.612, 224164.816]
17450    (168123.612, 224164.816]
18102     (224164.816, 280206.02]
14646     (224164.816, 280206.02]
Name: amount_spent, Length: 4339, dtype: category
Categories (5, interval[float64, right]): [(-280.206, 56041.204] < (56041.204, 112082.408] < (112082.408, 168123.612] < (168123.612, 224164.816] < (224164.816, 280206.02]]

In [84]:
labels = ['Very Low Amount Spent', 'Low Amount Spent', 'Moderate Amount Spent', 'High Amount Spent', 'Very High Amount Spent']

bins = pd.cut(ranked_agg_amount_spent['amount_spent'], 5, labels=labels) 
bins

bins[bins == 'High Amount Spent']

CustomerID
16446    High Amount Spent
17450    High Amount Spent
Name: amount_spent, dtype: category
Categories (5, object): ['Very Low Amount Spent' < 'Low Amount Spent' < 'Moderate Amount Spent' < 'High Amount Spent' < 'Very High Amount Spent']

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

In [85]:
ranked_agg_amount_spent

            amount_spent         Country
CustomerID
13256               0.00  United Kingdom
16738               3.75  United Kingdom
14792               6.20  United Kingdom
16454               6.90  United Kingdom
17956              12.75  United Kingdom
...                  ...             ...
14911          143825.06            EIRE
16446          168472.50  United Kingdom
17450          194550.79  United Kingdom
18102          259657.30  United Kingdom
14646          280206.02     Netherlands

[4339 rows x 2 columns]

In [86]:
ranked_agg_amount_spent['VIP Clients'] = ranked_agg_amount_spent['amount_spent'] >= 224164.816

ranked_agg_amount_spent

            amount_spent         Country  VIP Clients
CustomerID
13256               0.00  United Kingdom        False
16738               3.75  United Kingdom        False
14792               6.20  United Kingdom        False
16454               6.90  United Kingdom        False
17956              12.75  United Kingdom        False
...                  ...             ...          ...
14911          143825.06            EIRE        False
16446          168472.50  United Kingdom        False
17450          194550.79  United Kingdom        False
18102          259657.30  United Kingdom         True
14646          280206.02     Netherlands         True

[4339 rows x 3 columns]

In [87]:
ranked_agg_amount_spent['Preferred Clients'] = (ranked_agg_amount_spent['amount_spent'] < 224164.816) & (ranked_agg_amount_spent['amount_spent'] >= 168123.612)

ranked_agg_amount_spent

            amount_spent         Country  VIP Clients  Preferred Clients
CustomerID
13256               0.00  United Kingdom        False              False
16738               3.75  United Kingdom        False              False
14792               6.20  United Kingdom        False              False
16454               6.90  United Kingdom        False              False
17956              12.75  United Kingdom        False              False
...                  ...             ...          ...                ...
14911          143825.06            EIRE        False              False
16446          168472.50  United Kingdom        False               True
17450          194550.79  United Kingdom        False               True
18102          259657.30  United Kingdom         True              False
14646          280206.02     Netherlands         True              False

[4339 rows x 4 columns]

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [90]:
# your code here

ranked_agg_amount_spent

            amount_spent         Country  VIP Clients  Preferred Clients
CustomerID
13256               0.00  United Kingdom        False              False
16738               3.75  United Kingdom        False              False
14792               6.20  United Kingdom        False              False
16454               6.90  United Kingdom        False              False
17956              12.75  United Kingdom        False              False
...                  ...             ...          ...                ...
14911          143825.06            EIRE        False              False
16446          168472.50  United Kingdom        False               True
17450          194550.79  United Kingdom        False               True
18102          259657.30  United Kingdom         True              False
14646          280206.02     Netherlands         True              False

[4339 rows x 4 columns]

In [91]:
group = ranked_agg_amount_spent.groupby('Country')

agg_VIP_country = group.aggregate({'VIP Clients': np.sum})

agg_VIP_country

                      VIP Clients
Country
Australia                       0
Austria                         0
Bahrain                         0
Belgium                         0
Brazil                          0
Canada                          0
Channel Islands                 0
Cyprus                          0
Czech Republic                  0
Denmark                         0
EIRE                            0
European Community              0
Finland                         0
France                          0
Germany                         0
Greece                          0
Iceland                         0
Israel                          0
Italy                           0
Japan                           0
Lebanon                         0
Lithuania                       0
Malta                           0
Netherlands                     1
Norway                          0
Poland                          0
Portugal                        0
RSA                             0
Saudi Arabia                    0
Singapore                       0
Spain                           0
Sweden                          0
Switzerland                     0
USA                             0
United Arab Emirates            0
United Kingdom                  1
Unspecified                     0

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [93]:
# your code here

group = ranked_agg_amount_spent.groupby('Country')

agg_Preferred_country = group.aggregate({'Preferred Clients': np.sum })

agg_Preferred_country

                      Preferred Clients
Country
Australia                             0
Austria                               0
Bahrain                               0
Belgium                               0
Brazil                                0
Canada                                0
Channel Islands                       0
Cyprus                                0
Czech Republic                        0
Denmark                               0
EIRE                                  0
European Community                    0
Finland                               0
France                                0
Germany                               0
Greece                                0
Iceland                               0
Israel                                0
Italy                                 0
Japan                                 0
Lebanon                               0
Lithuania                             0
Malta                                 0
Netherlands                           0
Norway                                0
Poland                                0
Portugal                              0
RSA                                   0
Saudi Arabia                          0
Singapore                             0
Spain                                 0
Sweden                                0
Switzerland                           0
USA                                   0
United Arab Emirates                  0
United Kingdom                        2
Unspecified                           0

In [97]:
agg_VIP_Preferred_country = agg_VIP_country['VIP Clients'] + agg_Preferred_country['Preferred Clients']

agg_VIP_Preferred_country

Country
Australia               0
Austria                 0
Bahrain                 0
Belgium                 0
Brazil                  0
Canada                  0
Channel Islands         0
Cyprus                  0
Czech Republic          0
Denmark                 0
EIRE                    0
European Community      0
Finland                 0
France                  0
Germany                 0
Greece                  0
Iceland                 0
Israel                  0
Italy                   0
Japan                   0
Lebanon                 0
Lithuania               0
Malta                   0
Netherlands             1
Norway                  0
Poland                  0
Portugal                0
RSA                     0
Saudi Arabia            0
Singapore               0
Spain                   0
Sweden                  0
Switzerland             0
USA                     0
United Arab Emirates    0
United Kingdom          3
Unspecified             0
dtype: int64